STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5G9J-DK2/stm32u5g9j_discovery_hspi.c
/**
  ******************************************************************************
  * @file    stm32u5g9j_discovery_hspi.c
  * @author  MCD Application Team
  * @brief   This file includes a standard driver for the MX66UW1G45G
  *          HSPI memories mounted on the STM32U5G9J-DK2 board.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
  [..]
   (#) This driver is used to drive the MX66UW1G45G Octal NOR
       external memories mounted on STM32U5G9J-DK2 board.

   (#) This driver need specific component driver (MX66UW1G45G) to be included with.

   (#) MX66UW1G45G Initialization steps:
       (++) Initialize the HSPI external memory using the BSP_HSPI_NOR_Init() function. This
            function includes the MSP layer hardware resources initialization and the
            HSPI interface with the external memory.

   (#) MX66UW1G45G Octal NOR memory operations
       (++) HSPI memory can be accessed with read/write operations once it is
            initialized.
            Read/write operation can be performed with AHB access using the functions
            BSP_HSPI_NOR_Read()/BSP_HSPI_NOR_Write().
       (++) The function BSP_HSPI_NOR_GetInfo() returns the configuration of the HSPI memory.
            (see the HSPI memory data sheet)
       (++) Perform erase block operation using the function BSP_HSPI_NOR_Erase_Block() and by
            specifying the block address. You can perform an erase operation of the whole
            chip by calling the function BSP_HSPI_NOR_Erase_Chip().
       (++) The function BSP_HSPI_NOR_GetStatus() returns the current status of the HSPI memory.
            (see the HSPI memory data sheet)
       (++) The memory access can be configured in memory-mapped mode with the call of
            function BSP_HSPI_NOR_EnableMemoryMapped(). To go back in indirect mode, the
            function BSP_HSPI_NOR_DisableMemoryMapped() should be used.
       (++) The erase operation can be suspend and resume with using functions
            BSP_HSPI_NOR_SuspendErase() and BSP_HSPI_NOR_ResumeErase()
       (++) It is possible to put the memory in deep power-down mode to reduce its consumption.
            For this, the function BSP_HSPI_NOR_EnterDeepPowerDown() should be called. To leave
            the deep power-down mode, the function BSP_HSPI_NOR_LeaveDeepPowerDown() should be called.
       (++) The function BSP_HSPI_NOR_ReadID() returns the identifier of the memory
            (see the HSPI memory data sheet)
       (++) The configuration of the interface between peripheral and memory is done by
            the function BSP_HSPI_NOR_ConfigFlash(), three modes are possible :
            - SPI : instruction, address and data on one line
            - STR OPI : instruction, address and data on eight lines with sampling on one edge of clock
            - DTR OPI : instruction, address and data on eight lines with sampling on both edgaes of clock


  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32u5g9j_discovery_hspi.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32U5G9J_DK2
  * @{
  */

/** @defgroup STM32U5G9J_DK2_HSPI HSPI
  * @{
  */

/* Exported variables --------------------------------------------------------*/
/** @addtogroup STM32U5G9J_DK2_HSPI_NOR_Exported_Variables HSPI NOR Exported Variables
  * @{
  */
static XSPI_HandleTypeDef hhspi_nor[HSPI_NOR_INSTANCES_NUMBER] = {0};
static HSPI_NOR_Ctx_t HSPI_Nor_Ctx[HSPI_NOR_INSTANCES_NUMBER]  = {{
    HSPI_ACCESS_NONE,
    MX66UW1G45G_SPI_MODE,
    MX66UW1G45G_STR_TRANSFER
  }
};
/**
  * @}
  */

/* Private constants --------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup STM32U5G9J_DK2_HSPI_NOR_Private_Variables HSPI NOR Private Variables
  * @{
  */
#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 1U)
static uint32_t HSPINor_IsMspCbValid[HSPI_NOR_INSTANCES_NUMBER] = {0};
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS == 1) */

/**
  * @}
  */



/* Private functions ---------------------------------------------------------*/

/** @defgroup STM32U5G9J_DK2_HSPI_NOR_Private_Functions HSPI NOR Private Functions
  * @{
  */
static void    HSPI_NOR_MspInit(XSPI_HandleTypeDef *hhspi);
static void    HSPI_NOR_MspDeInit(XSPI_HandleTypeDef *hhspi);
static int32_t HSPI_NOR_ResetMemory(uint32_t Instance);
static int32_t HSPI_NOR_EnterDOPIMode(uint32_t Instance);
static int32_t HSPI_NOR_EnterSOPIMode(uint32_t Instance);
static int32_t HSPI_NOR_ExitOPIMode(uint32_t Instance);
/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/

/** @addtogroup STM32U5G9J_DK2_HSPI_NOR_Exported_Functions HSPI NOR Exported Functions
  * @{
  */

/**
  * @brief  Initializes the HSPI interface.
  * @param  Instance   HSPI Instance
  * @param  Init       HSPI Init structure
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_Init(uint32_t Instance, BSP_HSPI_NOR_Init_t *Init)
{
  int32_t ret;
  BSP_HSPI_NOR_Info_t pInfo;
  MX_HSPI_InitTypeDef hspi_init;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if the instance is already initialized */
    if (HSPI_Nor_Ctx[Instance].IsInitialized == HSPI_ACCESS_NONE)
    {
#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 0U)
      /* Msp HSPI initialization */
      HSPI_NOR_MspInit(&hhspi_nor[Instance]);
#else
      /* Register the HSPI MSP Callbacks */
      if (HSPINor_IsMspCbValid[Instance] == 0UL)
      {
        if (BSP_HSPI_NOR_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_PERIPH_FAILURE;
        }
      }
#endif /* USE_HAL_XSPI_REGISTER_CALLBACKS */

      /* Get Flash information of one memory */
      (void)MX66UW1G45G_GetFlashInfo(&pInfo);

      /* Fill config structure */
      hspi_init.ClockPrescaler = 0x00;
      hspi_init.MemorySize     = (uint32_t)POSITION_VAL((uint32_t)pInfo.FlashSize);
      hspi_init.SampleShifting = HAL_XSPI_SAMPLE_SHIFT_NONE;
      hspi_init.TransferRate   = (uint32_t)Init->TransferRate;

      /* STM32 HSPI interface initialization */
      if (MX_HSPI_NOR_Init(&hhspi_nor[Instance], &hspi_init) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }

      if (MX_HSPI_ClockConfig(&hhspi_nor[Instance]) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }

      /* HSPI memory reset */
      else if (HSPI_NOR_ResetMemory(Instance) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      /* Check if memory is ready */
      else if (MX66UW1G45G_AutoPollingMemReady(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                               HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      /* Configure the memory */
      else if (BSP_HSPI_NOR_ConfigFlash(Instance, Init->InterfaceMode, Init->TransferRate) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else
      {
        ret = BSP_ERROR_NONE;
      }
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  De-Initializes the HSPI interface.
  * @param  Instance   HSPI Instance
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_DeInit(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

