STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5G9J-DK2/stm32u5g9j_discovery_hspi.c
  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if the instance is already initialized */
    if (HSPI_Nor_Ctx[Instance].IsInitialized != HSPI_ACCESS_NONE)
    {
      /* Disable Memory mapped mode */
      if (HSPI_Nor_Ctx[Instance].IsInitialized == HSPI_ACCESS_MMP)
      {
        if (BSP_HSPI_NOR_DisableMemoryMappedMode(Instance) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_COMPONENT_FAILURE;
        }
      }

      /* Set default HSPI_Nor_Ctx values */
      HSPI_Nor_Ctx[Instance].IsInitialized = HSPI_ACCESS_NONE;
      HSPI_Nor_Ctx[Instance].InterfaceMode = BSP_HSPI_NOR_SPI_MODE;
      HSPI_Nor_Ctx[Instance].TransferRate  = BSP_HSPI_NOR_STR_TRANSFER;

#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 0)
      HSPI_NOR_MspDeInit(&hhspi_nor[Instance]);
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS == 0) */

      /* Call the DeInit function to reset the driver */
      if (HAL_XSPI_DeInit(&hhspi_nor[Instance]) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
    }
  }

  /* Return BSP status */
  return ret;
}
/**
  * @}
  */

/** @addtogroup STM32U5G9J_DK2_HSPI_Exported_Init_Functions HSPI Exported Init Functions
  * @{
  */

/**
  * @brief  Initializes the HSPI interface.
  * @param  hhspi          HSPI handle
  * @param  Init           HSPI config structure
  * @retval BSP status
  */
__weak HAL_StatusTypeDef MX_HSPI_NOR_Init(XSPI_HandleTypeDef *hhspi, MX_HSPI_InitTypeDef *Init)
{
  /* HSPI initialization */
  hhspi->Instance = HSPI1;

  hhspi->Init.FifoThresholdByte       = 1;
  hhspi->Init.MemorySize              = Init->MemorySize; /* 1 GBits */
  hhspi->Init.ChipSelectHighTimeCycle = 2;
  hhspi->Init.FreeRunningClock        = HAL_XSPI_FREERUNCLK_DISABLE;
  hhspi->Init.ClockMode               = HAL_XSPI_CLOCK_MODE_0;
  hhspi->Init.DelayHoldQuarterCycle   = HAL_XSPI_DHQC_DISABLE;
  hhspi->Init.ClockPrescaler          = Init->ClockPrescaler;
  hhspi->Init.SampleShifting          = Init->SampleShifting;
  hhspi->Init.ChipSelectBoundary      = HAL_XSPI_BONDARYOF_NONE;
  hhspi->Init.MemoryMode              = HAL_XSPI_SINGLE_MEM;
  hhspi->Init.WrapSize                = HAL_XSPI_WRAP_NOT_SUPPORTED;

  if (Init->TransferRate == (uint32_t) BSP_HSPI_NOR_DTR_TRANSFER)
  {
    hhspi->Init.MemoryType            = HAL_XSPI_MEMTYPE_MACRONIX;
    hhspi->Init.DelayHoldQuarterCycle = HAL_XSPI_DHQC_ENABLE;
  }
  else
  {
    hhspi->Init.MemoryType            = HAL_XSPI_MEMTYPE_MACRONIX;
    hhspi->Init.DelayHoldQuarterCycle = HAL_XSPI_DHQC_DISABLE;
  }
  return HAL_XSPI_Init(hhspi);
}
/**
  * @}
  */

/** @addtogroup STM32U5G9J_DK2_HSPI_Exported_Init_Functions HSPI Exported Init Functions
  * @{
  */

/**
  * @brief  XSPI Clock Config for HSPI interface.
  * @param  hhspi          HSPI handle
  *         Being __weak it can be overwritten by the application
  * @retval HAL_status
  */
__weak HAL_StatusTypeDef MX_HSPI_ClockConfig(XSPI_HandleTypeDef *hhspi)
{

  RCC_PeriphCLKInitTypeDef  PLL2InitPeriph = {0};

  /* hhspi unused argument(s) compilation warning */
  UNUSED(hhspi);

  /* Start and configurre PLL2 */
  /* HSE = 16MHZ */
  /* 16/(M=4)  = 4MHz input */
  /* 4*(N=65)  = 260MHz VCO (almost max) */
  /* 260/(Q=2) = 130 for XSPI */
  PLL2InitPeriph.PeriphClockSelection = RCC_PERIPHCLK_HSPI;
  PLL2InitPeriph.HspiClockSelection = RCC_HSPICLKSOURCE_PLL2;
  PLL2InitPeriph.PLL2.PLL2M = 4;
  PLL2InitPeriph.PLL2.PLL2N = 65;
  PLL2InitPeriph.PLL2.PLL2P = 2;
  PLL2InitPeriph.PLL2.PLL2Q = 2;
  PLL2InitPeriph.PLL2.PLL2R = 2;
  PLL2InitPeriph.PLL2.PLL2FRACN = 0;
  PLL2InitPeriph.PLL2.PLL2RGE =  RCC_PLLVCIRANGE_1;
  PLL2InitPeriph.PLL2.PLL2ClockOut = RCC_PLL2_DIVQ;
  PLL2InitPeriph.PLL2.PLL2Source = RCC_PLLSOURCE_HSE;
  return HAL_RCCEx_PeriphCLKConfig(&PLL2InitPeriph);
}
/**
  * @}
  */



/** @addtogroup STM32U5G9J_DK2_HSPI_NOR_Exported_Functions HSPI NOR Exported Functions
  * @{
  */
#if (USE_HAL_XSPI_REGISTER_CALLBACKS == 1)
/**
  * @brief Default BSP HSPI Msp Callbacks
  * @param Instance      HSPI Instance
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_RegisterDefaultMspCallbacks(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_XSPI_RegisterCallback(&hhspi_nor[Instance], HAL_XSPI_MSP_INIT_CB_ID, HSPI_NOR_MspInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_XSPI_RegisterCallback(&hhspi_nor[Instance], HAL_XSPI_MSP_DEINIT_CB_ID, HSPI_NOR_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      HSPINor_IsMspCbValid[Instance] = 1U;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief BSP HSPI Msp Callback registering
  * @param Instance     HSPI Instance
  * @param CallBacks    pointer to MspInit/MspDeInit callbacks functions
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_RegisterMspCallbacks(uint32_t Instance, BSP_HSPI_Cb_t *CallBacks)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Register MspInit/MspDeInit Callbacks */
    if (HAL_XSPI_RegisterCallback(&hhspi_nor[Instance], HAL_XSPI_MSP_INIT_CB_ID, CallBacks->pMspInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if (HAL_XSPI_RegisterCallback(&hhspi_nor[Instance],
                                       HAL_XSPI_MSP_DEINIT_CB_ID, CallBacks->pMspDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      HSPINor_IsMspCbValid[Instance] = 1U;
    }
  }

  /* Return BSP status */
  return ret;
}
#endif /* (USE_HAL_XSPI_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Reads an amount of data from the HSPI memory.
  * @param  Instance  HSPI instance
  * @param  pData     Pointer to data to be read
  * @param  ReadAddr  Read start address
  * @param  Size      Size of data to read
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_Read(uint32_t Instance, uint8_t *pData, uint32_t ReadAddr, uint32_t Size)
{
  int32_t ret;

