STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5G9J-DK2/stm32u5g9j_discovery_hspi.c
  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (MX66UW1G45G_ReadSecurityRegister(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                         HSPI_Nor_Ctx[Instance].TransferRate, reg) != MX66UW1G45G_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Check the value of the register */
    else if ((reg[0] & (MX66UW1G45G_SECR_P_FAIL | MX66UW1G45G_SECR_E_FAIL)) != 0U)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if ((reg[0] & (MX66UW1G45G_SECR_PSB | MX66UW1G45G_SECR_ESB)) != 0U)
    {
      ret = BSP_ERROR_HSPI_SUSPENDED;
    }
    else if (MX66UW1G45G_ReadStatusRegister(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                            HSPI_Nor_Ctx[Instance].TransferRate, reg) != MX66UW1G45G_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }/* Check the value of the register */
    else if ((reg[0] & MX66UW1G45G_SR_WIP) != 0U)
    {
      ret = BSP_ERROR_BUSY;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Return the configuration of the HSPI memory.
  * @param  Instance  HSPI instance
  * @param  pInfo     pointer on the configuration structure
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_GetInfo(uint32_t Instance, BSP_HSPI_NOR_Info_t *pInfo)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    (void)MX66UW1G45G_GetFlashInfo(pInfo);
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Configure the HSPI in memory-mapped mode
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_EnableMemoryMappedMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (HSPI_Nor_Ctx[Instance].TransferRate == BSP_HSPI_NOR_STR_TRANSFER)
    {
      if (MX66UW1G45G_EnableMemoryMappedModeSTR(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                                MX66UW1G45G_4BYTES_SIZE) != MX66UW1G45G_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else /* Update HSPI context if all operations are well done */
      {
        HSPI_Nor_Ctx[Instance].IsInitialized = HSPI_ACCESS_MMP;
      }
    }
    else
    {
      if (MX66UW1G45G_EnableMemoryMappedModeDTR(&hhspi_nor[Instance],
                                                HSPI_Nor_Ctx[Instance].InterfaceMode) != MX66UW1G45G_OK)
      {
        ret = BSP_ERROR_COMPONENT_FAILURE;
      }
      else /* Update HSPI context if all operations are well done */
      {
        HSPI_Nor_Ctx[Instance].IsInitialized = HSPI_ACCESS_MMP;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Exit form memory-mapped mode
  *         Only 1 Instance can running MMP mode. And it will lock system at this mode.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_DisableMemoryMappedMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (HSPI_Nor_Ctx[Instance].IsInitialized != HSPI_ACCESS_MMP)
    {
      ret = BSP_ERROR_HSPI_MMP_UNLOCK_FAILURE;
    }/* Abort MMP back to indirect mode */
    else if (HAL_XSPI_Abort(&hhspi_nor[Instance]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else /* Update HSPI NOR context if all operations are well done */
    {
      HSPI_Nor_Ctx[Instance].IsInitialized = HSPI_ACCESS_INDIRECT;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Get flash ID 3 Bytes:
  *         Manufacturer ID, Memory type, Memory density
  * @param  Instance  HSPI instance
  * @param  Id Pointer to flash ID bytes
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_ReadID(uint32_t Instance, uint8_t *Id)
{
  int32_t ret;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (MX66UW1G45G_ReadID(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                              HSPI_Nor_Ctx[Instance].TransferRate, Id) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Set Flash to desired Interface mode. And this instance becomes current instance.
  *         If current instance running at MMP mode then this function doesn't work.
  *         Indirect -> Indirect
  * @param  Instance  HSPI instance
  * @param  Mode      HSPI mode
  * @param  Rate      HSPI transfer rate
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_ConfigFlash(uint32_t Instance, BSP_HSPI_NOR_Interface_t Mode, BSP_HSPI_NOR_Transfer_t Rate)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* Check if MMP mode locked ************************************************/
    if (HSPI_Nor_Ctx[Instance].IsInitialized == HSPI_ACCESS_MMP)
    {
      ret = BSP_ERROR_HSPI_MMP_LOCK_FAILURE;
    }
    else
    {
      /* Setup Flash interface ***************************************************/
      switch (HSPI_Nor_Ctx[Instance].InterfaceMode)
      {
        case BSP_HSPI_NOR_OPI_MODE :  /* 8-8-8 commands */
          if ((Mode != BSP_HSPI_NOR_OPI_MODE) || (Rate != HSPI_Nor_Ctx[Instance].TransferRate))
          {
            /* Exit OPI mode */
            ret = HSPI_NOR_ExitOPIMode(Instance);

            if ((ret == BSP_ERROR_NONE) && (Mode == BSP_HSPI_NOR_OPI_MODE))
            {

              if (HSPI_Nor_Ctx[Instance].TransferRate == BSP_HSPI_NOR_STR_TRANSFER)
              {
                /* Enter DTR OPI mode */
                ret = HSPI_NOR_EnterDOPIMode(Instance);
              }
              else
              {
                /* Enter STR OPI mode */
                ret = HSPI_NOR_EnterSOPIMode(Instance);
              }
            }
          }
          break;

        case BSP_HSPI_NOR_SPI_MODE :  /* 1-1-1 commands, Power on H/W default setting */
        default :
          if (Mode == BSP_HSPI_NOR_OPI_MODE)
          {
            if (Rate == BSP_HSPI_NOR_STR_TRANSFER)
            {
              /* Enter STR OPI mode */
              ret = HSPI_NOR_EnterSOPIMode(Instance);
            }
            else
            {
              /* Enter DTR OPI mode */
              ret = HSPI_NOR_EnterDOPIMode(Instance);
            }
          }
          break;
      }

      /* Update HSPI context if all operations are well done */
      if (ret == BSP_ERROR_NONE)
      {
        /* Update current status parameter *****************************************/
        HSPI_Nor_Ctx[Instance].IsInitialized = HSPI_ACCESS_INDIRECT;
        HSPI_Nor_Ctx[Instance].InterfaceMode = Mode;
        HSPI_Nor_Ctx[Instance].TransferRate  = Rate;
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function suspends an ongoing erase command.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_SuspendErase(uint32_t Instance)
{
  int32_t ret;

