STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5G9J-DK2/stm32u5g9j_discovery_hspi.c
  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check whether the device is busy (erase operation is in progress). */
  else if (BSP_HSPI_NOR_GetStatus(Instance) != BSP_ERROR_BUSY)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (MX66UW1G45G_Suspend(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                               HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (BSP_HSPI_NOR_GetStatus(Instance) != BSP_ERROR_HSPI_SUSPENDED)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function resumes a paused erase command.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_ResumeErase(uint32_t Instance)
{
  int32_t ret;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check whether the device is busy (erase operation is in progress). */
  else if (BSP_HSPI_NOR_GetStatus(Instance) != BSP_ERROR_HSPI_SUSPENDED)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (MX66UW1G45G_Resume(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                              HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /*
  When this command is executed, the status register write in progress bit is set to 1, and
  the flag status register program erase controller bit is set to 0. This command is ignored
  if the device is not in a suspended state.
  */
  else if (BSP_HSPI_NOR_GetStatus(Instance) != BSP_ERROR_BUSY)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function enter the HSPI memory in deep power down mode.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_EnterDeepPowerDown(uint32_t Instance)
{
  int32_t ret;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (MX66UW1G45G_EnterPowerDown(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                      HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* ---          Memory takes 10us max to enter deep power down          --- */

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function leave the HSPI memory from deep power down mode.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
int32_t BSP_HSPI_NOR_LeaveDeepPowerDown(uint32_t Instance)
{
  int32_t ret;

  /* Check if the instance is supported */
  if (Instance >= HSPI_NOR_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (MX66UW1G45G_NoOperation(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                   HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* --- A NOP command is sent to the memory, as the nCS should be low for at least 20 ns --- */
  /* ---                  Memory takes 30us min to leave deep power down                  --- */

  /* Return BSP status */
  return ret;
}
/**
  * @}
  */

/** @defgroup STM32U5G9J_DK2_HSPI_NOR_Private_Functions HSPI NOR Private Functions
  * @{
  */

/**
  * @brief  Initializes the HSPI MSP.
  * @param  hhspi HSPI handle
  * @retval None
  */
static void HSPI_NOR_MspInit(XSPI_HandleTypeDef *hhspi)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* hhspi unused argument(s) compilation warning */
  UNUSED(hhspi);

  /* Enable the HSPI memory interface clock */
  HSPI_NOR_CLK_ENABLE();

  /* Reset the HSPI memory interface */
  HSPI_NOR_FORCE_RESET();
  HSPI_NOR_RELEASE_RESET();

  /* Enable GPIO clocks */
  HSPI_NOR_CLK_GPIO_CLK_ENABLE();
  HSPI_NOR_DQS_GPIO_CLK_ENABLE();
  HSPI_NOR_CS_GPIO_CLK_ENABLE();
  HSPI_NOR_D0_GPIO_CLK_ENABLE();
  HSPI_NOR_D1_GPIO_CLK_ENABLE();
  HSPI_NOR_D2_GPIO_CLK_ENABLE();
  HSPI_NOR_D3_GPIO_CLK_ENABLE();
  HSPI_NOR_D4_GPIO_CLK_ENABLE();
  HSPI_NOR_D5_GPIO_CLK_ENABLE();
  HSPI_NOR_D6_GPIO_CLK_ENABLE();
  HSPI_NOR_D7_GPIO_CLK_ENABLE();

  /* HSPI CS GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_CS_PIN;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_PULLUP;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = HSPI_NOR_CS_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_CS_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI DQS GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_DQS_PIN;
  GPIO_InitStruct.Alternate = HSPI_NOR_DQS_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_DQS_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI CLK GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_CLK_PIN;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Alternate = HSPI_NOR_CLK_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_CLK_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D0 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_D0_PIN;
  GPIO_InitStruct.Alternate = HSPI_NOR_D0_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_D0_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D1 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_D1_PIN;
  GPIO_InitStruct.Alternate = HSPI_NOR_D1_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_D1_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D2 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_D2_PIN;
  GPIO_InitStruct.Alternate = HSPI_NOR_D2_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_D2_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D3 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_D3_PIN;
  GPIO_InitStruct.Alternate = HSPI_NOR_D3_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_D3_GPIO_PORT, &GPIO_InitStruct);

