STMicroelectronics/STM32CubeU5/Drivers/BSP/STM32U5G9J-DK2/stm32u5g9j_discovery_hspi.c
  /* HSPI D4 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_D4_PIN;
  GPIO_InitStruct.Alternate = HSPI_NOR_D4_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_D4_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D5 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_D5_PIN;
  GPIO_InitStruct.Alternate = HSPI_NOR_D5_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_D5_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D6 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_D6_PIN;
  GPIO_InitStruct.Alternate = HSPI_NOR_D6_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_D6_GPIO_PORT, &GPIO_InitStruct);

  /* HSPI D7 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = HSPI_NOR_D7_PIN;
  GPIO_InitStruct.Alternate = HSPI_NOR_D7_PIN_AF;
  HAL_GPIO_Init(HSPI_NOR_D7_GPIO_PORT, &GPIO_InitStruct);
}

/**
  * @brief  De-Initializes the HSPI MSP.
  * @param  hhspi HSPI handle
  * @retval None
  */
static void HSPI_NOR_MspDeInit(XSPI_HandleTypeDef *hhspi)
{
  /* hhspi unused argument(s) compilation warning */
  UNUSED(hhspi);

  /* HSPI GPIO pins de-configuration  */
  HAL_GPIO_DeInit(HSPI_NOR_CLK_GPIO_PORT, HSPI_NOR_CLK_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_DQS_GPIO_PORT, HSPI_NOR_DQS_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_CS_GPIO_PORT, HSPI_NOR_CS_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_D0_GPIO_PORT, HSPI_NOR_D0_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_D1_GPIO_PORT, HSPI_NOR_D1_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_D2_GPIO_PORT, HSPI_NOR_D2_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_D3_GPIO_PORT, HSPI_NOR_D3_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_D4_GPIO_PORT, HSPI_NOR_D4_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_D5_GPIO_PORT, HSPI_NOR_D5_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_D6_GPIO_PORT, HSPI_NOR_D6_PIN);
  HAL_GPIO_DeInit(HSPI_NOR_D7_GPIO_PORT, HSPI_NOR_D7_PIN);

  /* Reset the HSPI memory interface */
  HSPI_NOR_FORCE_RESET();
  HSPI_NOR_RELEASE_RESET();

  /* Disable the HSPI memory interface clock */
  HSPI_NOR_CLK_DISABLE();
}

/**
  * @brief  This function reset the HSPI memory.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
static int32_t HSPI_NOR_ResetMemory(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;


  if (MX66UW1G45G_ResetEnable(&hhspi_nor[Instance], BSP_HSPI_NOR_SPI_MODE,
                              BSP_HSPI_NOR_STR_TRANSFER) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (MX66UW1G45G_ResetMemory(&hhspi_nor[Instance], BSP_HSPI_NOR_SPI_MODE,
                                   BSP_HSPI_NOR_STR_TRANSFER) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (MX66UW1G45G_ResetEnable(&hhspi_nor[Instance], BSP_HSPI_NOR_OPI_MODE,
                                   BSP_HSPI_NOR_STR_TRANSFER) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (MX66UW1G45G_ResetMemory(&hhspi_nor[Instance], BSP_HSPI_NOR_OPI_MODE,
                                   BSP_HSPI_NOR_STR_TRANSFER) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (MX66UW1G45G_ResetEnable(&hhspi_nor[Instance], BSP_HSPI_NOR_OPI_MODE,
                                   BSP_HSPI_NOR_DTR_TRANSFER) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else if (MX66UW1G45G_ResetMemory(&hhspi_nor[Instance], BSP_HSPI_NOR_OPI_MODE,
                                   BSP_HSPI_NOR_DTR_TRANSFER) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    HSPI_Nor_Ctx[Instance].IsInitialized = HSPI_ACCESS_INDIRECT;     /* After reset S/W setting to indirect access  */
    HSPI_Nor_Ctx[Instance].InterfaceMode = BSP_HSPI_NOR_SPI_MODE;    /* After reset H/W back to SPI mode by default */
    HSPI_Nor_Ctx[Instance].TransferRate  = BSP_HSPI_NOR_STR_TRANSFER; /* After reset S/W setting to STR mode        */

    /* After SWreset CMD, wait in case SWReset occurred during erase operation */
    HAL_Delay(MX66UW1G45G_RESET_MAX_TIME);
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function enables the octal DTR mode of the memory.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
static int32_t HSPI_NOR_EnterDOPIMode(uint32_t Instance)
{
  int32_t ret;
  uint8_t reg[2];

  /* Enable write operations */
  if (MX66UW1G45G_WriteEnable(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                              HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Write Configuration register 2 (with new dummy cycles) */
  else if (MX66UW1G45G_WriteCfg2Register(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                         HSPI_Nor_Ctx[Instance].TransferRate, MX66UW1G45G_CR2_REG3_ADDR,
                                         MX66UW1G45G_CR2_DC_6_CYCLES) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Enable write operations */
  else if (MX66UW1G45G_WriteEnable(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                   HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Write Configuration register 2 (with Octal I/O SPI protocol) */
  else if (MX66UW1G45G_WriteCfg2Register(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                         HSPI_Nor_Ctx[Instance].TransferRate, MX66UW1G45G_CR2_REG1_ADDR,
                                         MX66UW1G45G_CR2_DOPI) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* Wait that the configuration is effective and check that memory is ready */
    HAL_Delay(MX66UW1G45G_WRITE_REG_MAX_TIME);

    /* Reconfigure the memory type of the peripheral */
    hhspi_nor[Instance].Init.MemoryType            = HAL_XSPI_MEMTYPE_MACRONIX;
    hhspi_nor[Instance].Init.DelayHoldQuarterCycle = HAL_XSPI_DHQC_ENABLE;
    if (HAL_XSPI_Init(&hhspi_nor[Instance]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    /* Check Flash busy ? */
    else if (MX66UW1G45G_AutoPollingMemReady(&hhspi_nor[Instance], BSP_HSPI_NOR_OPI_MODE,
                                             BSP_HSPI_NOR_DTR_TRANSFER) != MX66UW1G45G_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    /* Check the configuration has been correctly done */
    else if (MX66UW1G45G_ReadCfg2Register(&hhspi_nor[Instance], BSP_HSPI_NOR_OPI_MODE, BSP_HSPI_NOR_DTR_TRANSFER,
                                          MX66UW1G45G_CR2_REG1_ADDR, reg) != MX66UW1G45G_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if (reg[0] != MX66UW1G45G_CR2_DOPI)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function enables the octal STR mode of the memory.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
static int32_t HSPI_NOR_EnterSOPIMode(uint32_t Instance)
{
  int32_t ret;
  uint8_t reg[2];

  /* Enable write operations */
  if (MX66UW1G45G_WriteEnable(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                              HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Write Configuration register 2 (with new dummy cycles) */
  else if (MX66UW1G45G_WriteCfg2Register(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                         HSPI_Nor_Ctx[Instance].TransferRate, MX66UW1G45G_CR2_REG3_ADDR,
                                         MX66UW1G45G_CR2_DC_6_CYCLES) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Enable write operations */
  else if (MX66UW1G45G_WriteEnable(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                   HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  /* Write Configuration register 2 (with Octal I/O SPI protocol) */
  else if (MX66UW1G45G_WriteCfg2Register(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                         HSPI_Nor_Ctx[Instance].TransferRate, MX66UW1G45G_CR2_REG1_ADDR,
                                         MX66UW1G45G_CR2_SOPI) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* Wait that the configuration is effective and check that memory is ready */
    HAL_Delay(MX66UW1G45G_WRITE_REG_MAX_TIME);

    /* Check Flash busy ? */
    if (MX66UW1G45G_AutoPollingMemReady(&hhspi_nor[Instance], BSP_HSPI_NOR_OPI_MODE,
                                        BSP_HSPI_NOR_STR_TRANSFER) != MX66UW1G45G_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    /* Check the configuration has been correctly done */
    else if (MX66UW1G45G_ReadCfg2Register(&hhspi_nor[Instance], BSP_HSPI_NOR_OPI_MODE, BSP_HSPI_NOR_STR_TRANSFER,
                                          MX66UW1G45G_CR2_REG1_ADDR, reg) != MX66UW1G45G_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if (reg[0] != MX66UW1G45G_CR2_SOPI)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  This function disables the octal DTR or STR mode of the memory.
  * @param  Instance  HSPI instance
  * @retval BSP status
  */
static int32_t HSPI_NOR_ExitOPIMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;
  uint8_t reg[2];

  /* Enable write operations */
  if (MX66UW1G45G_WriteEnable(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                              HSPI_Nor_Ctx[Instance].TransferRate) != MX66UW1G45G_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    /* Write Configuration register 2 (with SPI protocol) */
    reg[0] = 0;
    reg[1] = 0;
    if (MX66UW1G45G_WriteCfg2Register(&hhspi_nor[Instance], HSPI_Nor_Ctx[Instance].InterfaceMode,
                                      HSPI_Nor_Ctx[Instance].TransferRate, MX66UW1G45G_CR2_REG1_ADDR,
                                      reg[0]) != MX66UW1G45G_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Wait that the configuration is effective and check that memory is ready */
      HAL_Delay(MX66UW1G45G_WRITE_REG_MAX_TIME);

      if (HSPI_Nor_Ctx[Instance].TransferRate == BSP_HSPI_NOR_DTR_TRANSFER)
      {
        /* Reconfigure the memory type of the peripheral */
        hhspi_nor[Instance].Init.MemoryType            = HAL_XSPI_MEMTYPE_MICRON;
        hhspi_nor[Instance].Init.DelayHoldQuarterCycle = HAL_XSPI_DHQC_DISABLE;
        if (HAL_XSPI_Init(&hhspi_nor[Instance]) != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
        /* Check Flash busy ? */
        if (MX66UW1G45G_AutoPollingMemReady(&hhspi_nor[Instance], BSP_HSPI_NOR_SPI_MODE,
                                            BSP_HSPI_NOR_STR_TRANSFER) != MX66UW1G45G_OK)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        /* Check the configuration has been correctly done */
        else if (MX66UW1G45G_ReadCfg2Register(&hhspi_nor[Instance], BSP_HSPI_NOR_SPI_MODE, BSP_HSPI_NOR_STR_TRANSFER,
                                              MX66UW1G45G_CR2_REG1_ADDR, reg) != MX66UW1G45G_OK)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else if (reg[0] != 0U)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
          /* Nothing to do */
        }
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

